app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"  ORDER BY "tasks"."created_at" DESC
---
	def index
		# @tasks = Task.order(:id)
		render json: Task.order(created_at: :desc)

INSERT INTO "tasks" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "hello hello"], ["created_at", "2015-07-31 02:23:41.740317"], ["updated_at", "2015-07-31 02:23:41.740317"]]
---
    task = Task.new(task_params)
    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 14]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "liar debuggahasdasd"], ["updated_at", "2015-07-31 03:16:32.196561"], ["id", 14]]
---
    task = Task.find(params[:id])
    if task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
    task = Task.find(params[:id])
    if task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", "f"], ["updated_at", "2015-07-31 02:54:31.785428"], ["id", 1]]
---
		task = Task.find(params[:task_id])
		if task.completed == true
			task.update_attributes(completed: false)